gdgly/stm32L151_nbiot_tmote_app_workspace/hc32L196_nbiot_tmote_app_spot/User/platform_map.c
/**
  *********************************************************************************************************
  * @file    platform_map.c
  * @author  Movebroad -- KK
  * @version V1.0
  * @date    2020-03-09
  * @brief   1TAB = 5Speace
  *********************************************************************************************************
  * @attention
  *
  *
  *
  *********************************************************************************************************
  */

#include "hc32l19x_config.h"
#include "platform_config.h"
#include "platform_map.h"
#include "delay.h"
#include "usart.h"
#include "hal_iwdg.h"
#include "hal_rtc.h"
#include "hal_beep.h"
#include "hal_vbat.h"
#include "hal_vptat.h"
#include "hal_vtemp.h"
#include "hal_aes.h"
#include "hal_crc.h"
#include "hal_flash.h"
#include "hal_iic.h"
#include "hal_bl24cxxp.h"
#include "hal_eeprom.h"
#include "hal_qmc5883l.h"
#include "hal_spi.h"
#include "hal_p25qxxh.h"
#include "hal_norflash.h"
#include "fifo.h"
#include "message.h"
#include "radio_hal_rf.h"
#include "radio_hal_app.h"
#include "fota.h"
#include "tmesh_xtea.h"

TCFG_SystemDataTypeDef TCFG_SystemData;





















/**********************************************************************************************************
 @Function			void  TCFG_EEPROM_SystemConfigInfo_Init(void)
 @Description			TCFG_EEPROM_SystemConfigInfo_Init				: 系统配置信息初始化
 @Input				void
 @Return				void
**********************************************************************************************************/
void  TCFG_EEPROM_SystemConfigInfo_Init(void)
{
	TCFG_EEPROM_ReadSystemConfigData();
	
	TCFG_EEPROM_Set_BootMode(TCFG_ENV_BOOTMODE_NORMALLY);
}

/**********************************************************************************************************
 @Function			void  TCFG_EEPROM_WriteSystemConfigData(void)
 @Description			TCFG_EEPROM_WriteSystemConfigData				: 写入系统配置信息
 @Input				void
 @Return				void
**********************************************************************************************************/
void  TCFG_EEPROM_WriteSystemConfigData(void)
{
	/* 写入Radio RF 通道 */
	TCFG_SystemData.RadioChannel = RADIO_RF_CHANNEL1;
	TCFG_EEPROM_Set_RadioChannel(TCFG_SystemData.RadioChannel);
	
	/* 写入Radio RF 心跳 */
	TCFG_SystemData.RadioHeartval = RADIO_RF_HEARTVAL;
	TCFG_EEPROM_Set_RadioHeartval(TCFG_SystemData.RadioHeartval);
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	/* SN & Vender Write to Backup space */
	TCFG_EEPROM_Set_Backup_MAC_SN(TCFG_EEPROM_Get_Source_MAC_SN());
	TCFG_EEPROM_Set_Backup_Vender(TCFG_EEPROM_Get_Source_Vender());
}

/**********************************************************************************************************
 @Function			void TCFG_EEPROM_WriteParameterData(void)
 @Description			TCFG_EEPROM_WriteParameterData				: 写入系统参数信息
 @Input				void
 @Return				void
**********************************************************************************************************/
void  TCFG_EEPROM_WriteSystemParamtData(void)
{
	
	
	
	
	
	
	
	
	
	
	/* Software Write to Backup space */
	TCFG_EEPROM_Set_Backup_SoftwareMajor(TCFG_EEPROM_Get_Source_SoftwareMajor());
	TCFG_EEPROM_Set_Backup_SoftwareMinor(TCFG_EEPROM_Get_Source_SoftwareMinor());
}

/**********************************************************************************************************
 @Function			void  TCFG_EEPROM_ReadSystemConfigData(void)
 @Description			TCFG_EEPROM_ReadSystemConfigData				: 读取系统配置信息
 @Input				void
 @Return				void
**********************************************************************************************************/
void  TCFG_EEPROM_ReadSystemConfigData(void)
{
	/* 获取MacSN */
	TCFG_SystemData.MacSN = TCFG_EEPROM_Get_MAC_SN();
	
	/* 获取Vender */
	TCFG_SystemData.Vender = TCFG_EEPROM_Get_Source_Vender();
	
	/* 获取MacSN String */
	TCFG_EEPROM_Get_MAC_SN_String();
	
	/* 获取Vender String */
	TCFG_EEPROM_Get_Vender_String();
	
	/* 获取BOOT版本号 */
	TCFG_SystemData.BootVersion = TCFG_EEPROM_Get_BootVersion();
	
	/* 获取BOOT运行模式 */
	TCFG_SystemData.BootRunmode = TCFG_EEPROM_Get_BootMode();
	
	/* 获取BOOT重启次数 */
	TCFG_SystemData.BootRecount = TCFG_EEPROM_Get_BootCount();
	
	/* 获取Radio RF 通道 */
	TCFG_SystemData.RadioChannel = TCFG_EEPROM_Get_RadioChannel();
	if ((TCFG_SystemData.RadioChannel != 36) && (TCFG_SystemData.RadioChannel != 4) && (TCFG_SystemData.RadioChannel != 6) && (TCFG_SystemData.RadioChannel != 16) && (TCFG_SystemData.RadioChannel != 26)) {
		TCFG_SystemData.RadioChannel = RADIO_RF_CHANNEL1;
		TCFG_EEPROM_Set_RadioChannel(TCFG_SystemData.RadioChannel);
	}
	
	/* 获取Radio RF 心跳 */
	TCFG_SystemData.RadioHeartval = TCFG_EEPROM_Get_RadioHeartval();
	if ((TCFG_SystemData.RadioHeartval < 1) || (TCFG_SystemData.RadioHeartval > 120)) {
		TCFG_SystemData.RadioHeartval = RADIO_RF_HEARTVAL;
		TCFG_EEPROM_Set_RadioHeartval(TCFG_SystemData.RadioHeartval);
	}
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
}
























/********************** Check if the SN & Vender and the Backup space are the same ***********************/
/**********************************************************************************************************
 @Function			bool  TCFG_EEPROM_CheckNewSerialInfomation(void)
 @Description			TCFG_EEPROM_CheckNewSerialInfomation			: 检测新的设备厂牌信息
 @Input				void
 @Return				bool
**********************************************************************************************************/
bool  TCFG_EEPROM_CheckNewSerialInfomation(void)
{
	if ((TCFG_EEPROM_Get_Backup_MAC_SN() == 0) && (TCFG_EEPROM_Get_Backup_Vender() == 0)) {
		return true;
	}
	
	if ((TCFG_EEPROM_Get_Backup_MAC_SN() != TCFG_EEPROM_Get_Source_MAC_SN()) || (TCFG_EEPROM_Get_Backup_Vender() != TCFG_EEPROM_Get_Source_Vender())) {
		return true;
	}
	
	return false;
}

u32   TCFG_EEPROM_Get_Source_MAC_SN(void)
{
	return FLASH_EEPROM_ReadWord(TCFG_FACTORY_MAC_SN_OFFSET);
}

u32   TCFG_EEPROM_Get_Source_Vender(void)
{
	return FLASH_EEPROM_ReadWord(TCFG_FACTORY_VENDER_OFFSET);
}

void  TCFG_EEPROM_Set_Backup_MAC_SN(u32 val)
{
	FLASH_EEPROM_WriteWord(TCFG_FACTORYBACKUP_MAC_SN_OFFSET, val);
}

u32   TCFG_EEPROM_Get_Backup_MAC_SN(void)
{
	return FLASH_EEPROM_ReadWord(TCFG_FACTORYBACKUP_MAC_SN_OFFSET);
}

void  TCFG_EEPROM_Set_Backup_Vender(u32 val)
{
	FLASH_EEPROM_WriteWord(TCFG_FACTORYBACKUP_VENDER_OFFSET, val);
}

u32   TCFG_EEPROM_Get_Backup_Vender(void)
{
	return FLASH_EEPROM_ReadWord(TCFG_FACTORYBACKUP_VENDER_OFFSET);
}
/*********************************************************************************************************/

